CPS-Projet/tests/tGestionCombat.org
* Test GestionCombat

** Cas de test 1.1 : GestionCombat::testInit
*** Condition initiale : ∅
*** Operation : L0 =(def) init(20, 4 ,10)
*** Oracle : 
**** estFrappe(L0, ?) = false
**** estGele(L0, ?) = false
**** mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster }
**** position(L0, Alex) = { 0 ; 6 ; 0 }
**** position(L0, Ryan) = { 0 ; 4 ; 0 }
**** position(L0, Slick) = { 19 ; 5 ; 0 }




** Cas de test 2.1 : GestionCombat::gererRIEN
*** Condition initiale : 
**** L =(def) init(20, 4 ,10)
**** map = { <Alex, RIEN>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> }
*** Operation : L0 =(def) gerer(L, map)
*** Oracle : 
**** estFrappe(L0, ?) = false
**** estGele(L0, ?) = false
**** mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster }
**** position(L0, Alex) = { 0 ; 6 ; 0 }
**** position(L0, Ryan) = { 0 ; 4 ; 0 }
**** position(L0, Slick) = { 19 ; 5 ; 0 }

** Cas de test 2.2 : GestionCombat::gererDROITE
*** Condition initiale : 
**** L =(def) init(20, 4 ,10)
**** map = { <Alex, DROITE>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> }
*** Operation : L0 =(def) gerer(L, map)
*** Oracle : 
**** estFrappe(L0, ?) = false
**** estGele(L0, ?) = false
**** mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster }
**** position(L0, Alex) = { 1 ; 6 ; 0 }
**** position(L0, Ryan) = { 0 ; 4 ; 0 }
**** position(L0, Slick) = { 19 ; 5 ; 0 }

** Cas de test 2.3 : GestionCombat::gererHAUT
*** Condition initiale : 
**** L =(def) init(20, 4 ,10)
**** map = { <Alex, HAUT>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> }
*** Operation : L0 =(def) gerer(L, map)
*** Oracle : 
**** estFrappe(L0, ?) = false
**** estGele(L0, ?) = false
**** mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster }
**** position(L0, Alex) = { 0 ; 7 ; 0 }
**** position(L0, Ryan) = { 0 ; 4 ; 0 }
**** position(L0, Slick) = { 19 ; 5 ; 0 }

** Cas de test 2.4 : GestionCombat::gererBAS
*** Condition initiale : 
**** L =(def) init(20, 4 ,10)
