CPS-Projet/tests/html/tGestionCombat.html
<?xml version="1.0" encoding="utf-8"?>

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"

               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml"

lang="en" xml:lang="en">

<head>

<title>tGestionCombat</title>

<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>

<meta name="generator" content="Org-mode"/>

<meta name="generated" content="2014-04-18 12:57:46 CEST"/>



<meta name="description" content=""/>

<meta name="keywords" content=""/>



</head>

<body>

<div id="content">



<h1 class="title">tGestionCombat</h1>





<div id="table-of-contents">

<h2>Table of Contents</h2>

<div id="text-table-of-contents">

<ul>

<li><a href="#sec-1">1 Test GestionCombat </a>

<ul>

<li><a href="#sec-1.1">1.1 Cas de test 1.1 : GestionCombat::testInit </a>

<ul>

<li><a href="#sec-1.1.1">1.1.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.1.2">1.1.2 Operation : L0 =(def) init(20, 4 ,10) </a></li>

<li><a href="#sec-1.1.3">1.1.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.2">1.2 Cas de test 2.1 : GestionCombat::gererRIEN </a>

<ul>

<li><a href="#sec-1.2.1">1.2.1 Condition initiale : </a></li>

<li><a href="#sec-1.2.2">1.2.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.2.3">1.2.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.3">1.3 Cas de test 2.2 : GestionCombat::gererDROITE </a>

<ul>

<li><a href="#sec-1.3.1">1.3.1 Condition initiale : </a></li>

<li><a href="#sec-1.3.2">1.3.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.3.3">1.3.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.4">1.4 Cas de test 2.3 : GestionCombat::gererHAUT </a>

<ul>

<li><a href="#sec-1.4.1">1.4.1 Condition initiale : </a></li>

<li><a href="#sec-1.4.2">1.4.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.4.3">1.4.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.5">1.5 Cas de test 2.4 : GestionCombat::gererBAS </a>

<ul>

<li><a href="#sec-1.5.1">1.5.1 Condition initiale : </a></li>

<li><a href="#sec-1.5.2">1.5.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.5.3">1.5.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.6">1.6 Cas de test 2.5 : GestionCombat::gererSAUTER </a>

<ul>

<li><a href="#sec-1.6.1">1.6.1 Condition initiale : </a></li>

<li><a href="#sec-1.6.2">1.6.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.6.3">1.6.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.7">1.7 Cas de test 2.6 : GestionCombat::gererGAUCHE </a>

<ul>

<li><a href="#sec-1.7.1">1.7.1 Condition initiale : </a></li>

<li><a href="#sec-1.7.2">1.7.2 Operation : L0 =(def) gerer(L, map) </a></li>

<li><a href="#sec-1.7.3">1.7.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.8">1.8 Cas de test 2.7 : GestionCombat::gererRAMASSER </a>

<ul>

<li><a href="#sec-1.8.1">1.8.1 Condition initiale : </a></li>

<li><a href="#sec-1.8.2">1.8.2 Operation : </a></li>

<li><a href="#sec-1.8.3">1.8.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.9">1.9 Cas de test 2.7 : GestionCombat::gererJETER </a>

<ul>

<li><a href="#sec-1.9.1">1.9.1 Condition initiale : </a></li>

<li><a href="#sec-1.9.2">1.9.2 Operation : </a></li>

<li><a href="#sec-1.9.3">1.9.3 Oracle : </a></li>

</ul>

</li>

</ul>

</li>

</ul>

</div>

</div>



<div id="outline-container-1" class="outline-2">

<h2 id="sec-1"><span class="section-number-2">1</span> Test GestionCombat </h2>

<div class="outline-text-2" id="text-1">







</div>



<div id="outline-container-1.1" class="outline-3">

<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Cas de test 1.1 : GestionCombat::testInit </h3>

<div class="outline-text-3" id="text-1.1">





</div>



<div id="outline-container-1.1.1" class="outline-4">

<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.1.1">



</div>



</div>



<div id="outline-container-1.1.2" class="outline-4">

<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Operation : L0 =(def) init(20, 4 ,10) </h4>

<div class="outline-text-4" id="text-1.1.2">



</div>



</div>



<div id="outline-container-1.1.3" class="outline-4">

<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.1.3">



<ul>

<li id="sec-1.1.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.1.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.1.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.1.3.4">position(L0, Alex) = { 0 ; 6 ; 0 } <br/>

</li>

<li id="sec-1.1.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.1.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>









</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.2" class="outline-3">

<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Cas de test 2.1 : GestionCombat::gererRIEN </h3>

<div class="outline-text-3" id="text-1.2">





</div>



<div id="outline-container-1.2.1" class="outline-4">

<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.2.1">



<ul>

<li id="sec-1.2.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.2.1.2">map = { &lt;Alex, RIEN&gt;, &lt;RYAN, RIEN&gt;, &lt;SLICK, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.2.2" class="outline-4">

<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.2.2">



</div>



</div>



<div id="outline-container-1.2.3" class="outline-4">

<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.2.3">



<ul>

<li id="sec-1.2.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.2.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.2.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.2.3.4">position(L0, Alex) = { 0 ; 6 ; 0 } <br/>

</li>

<li id="sec-1.2.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.2.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.3" class="outline-3">

<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Cas de test 2.2 : GestionCombat::gererDROITE </h3>

<div class="outline-text-3" id="text-1.3">





</div>



<div id="outline-container-1.3.1" class="outline-4">

<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.3.1">



<ul>

<li id="sec-1.3.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.3.1.2">map = { &lt;Alex, DROITE&gt;, &lt;RYAN, RIEN&gt;, &lt;SLICK, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.3.2" class="outline-4">

<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.3.2">



</div>



</div>



<div id="outline-container-1.3.3" class="outline-4">

<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.3.3">



<ul>

<li id="sec-1.3.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.3.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.3.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.3.3.4">position(L0, Alex) = { 1 ; 6 ; 0 } <br/>

</li>

<li id="sec-1.3.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.3.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.4" class="outline-3">

<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Cas de test 2.3 : GestionCombat::gererHAUT </h3>

<div class="outline-text-3" id="text-1.4">





</div>



<div id="outline-container-1.4.1" class="outline-4">

<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.4.1">



<ul>

<li id="sec-1.4.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.4.1.2">map = { &lt;Alex, HAUT&gt;, &lt;RYAN, RIEN&gt;, &lt;SLICK, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.4.2" class="outline-4">

<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.4.2">



</div>



</div>



<div id="outline-container-1.4.3" class="outline-4">

<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.4.3">



<ul>

<li id="sec-1.4.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.4.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.4.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.4.3.4">position(L0, Alex) = { 0 ; 7 ; 0 } <br/>

</li>

<li id="sec-1.4.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.4.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.5" class="outline-3">

<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Cas de test 2.4 : GestionCombat::gererBAS </h3>

<div class="outline-text-3" id="text-1.5">





</div>
