CPS-Projet/tests/tex/tGestionCombat.tex
% Created 2014-04-18 ven. 12:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}


\title{TGestionCombat}
\author{Kevin Coquart, Quentin Bunel}
\date{18 avril 2014}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Test GestionCombat}
\label{sec-1}


\subsection{Cas de test 1.1 : GestionCombat::testInit}
\label{sec-1.1}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.1.1}

\subsubsection{Operation : L0 =(def) init(20, 4 ,10)}
\label{sec-1.1.2}

\subsubsection{Oracle :}
\label{sec-1.1.3}

\begin{itemize}

\item estFrappe(L0, ?) = false\\
\label{sec-1.1.3.1}


\item estGele(L0, ?) = false\\
\label{sec-1.1.3.2}


\item mPerso(L0).keySet() = \{ Alex, Ryan, Slick, +3 gagnster \}\\
\label{sec-1.1.3.3}


\item position(L0, Alex) = \{ 0 ; 6 ; 0 \}\\
\label{sec-1.1.3.4}


\item position(L0, Ryan) = \{ 0 ; 4 ; 0 \}\\
\label{sec-1.1.3.5}


\item position(L0, Slick) = \{ 19 ; 5 ; 0 \}\\
\label{sec-1.1.3.6}





\end{itemize} % ends low level
\subsection{Cas de test 2.1 : GestionCombat::gererRIEN}
\label{sec-1.2}

\subsubsection{Condition initiale :}
\label{sec-1.2.1}

\begin{itemize}

\item L =(def) init(20, 4 ,10)\\
\label{sec-1.2.1.1}


\item map = \{ <Alex, RIEN>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> \}\\
\label{sec-1.2.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L0 =(def) gerer(L, map)}
\label{sec-1.2.2}

\subsubsection{Oracle :}
\label{sec-1.2.3}

\begin{itemize}

\item estFrappe(L0, ?) = false\\
\label{sec-1.2.3.1}


\item estGele(L0, ?) = false\\
\label{sec-1.2.3.2}


\item mPerso(L0).keySet() = \{ Alex, Ryan, Slick, +3 gagnster \}\\
\label{sec-1.2.3.3}


\item position(L0, Alex) = \{ 0 ; 6 ; 0 \}\\
\label{sec-1.2.3.4}


\item position(L0, Ryan) = \{ 0 ; 4 ; 0 \}\\
\label{sec-1.2.3.5}


\item position(L0, Slick) = \{ 19 ; 5 ; 0 \}\\
\label{sec-1.2.3.6}


\end{itemize} % ends low level
\subsection{Cas de test 2.2 : GestionCombat::gererDROITE}
\label{sec-1.3}

\subsubsection{Condition initiale :}
\label{sec-1.3.1}

\begin{itemize}

\item L =(def) init(20, 4 ,10)\\
\label{sec-1.3.1.1}


\item map = \{ <Alex, DROITE>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> \}\\
\label{sec-1.3.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L0 =(def) gerer(L, map)}
\label{sec-1.3.2}

\subsubsection{Oracle :}
\label{sec-1.3.3}

\begin{itemize}

\item estFrappe(L0, ?) = false\\
\label{sec-1.3.3.1}


\item estGele(L0, ?) = false\\
\label{sec-1.3.3.2}


\item mPerso(L0).keySet() = \{ Alex, Ryan, Slick, +3 gagnster \}\\
\label{sec-1.3.3.3}


\item position(L0, Alex) = \{ 1 ; 6 ; 0 \}\\
\label{sec-1.3.3.4}


\item position(L0, Ryan) = \{ 0 ; 4 ; 0 \}\\
\label{sec-1.3.3.5}


\item position(L0, Slick) = \{ 19 ; 5 ; 0 \}\\
\label{sec-1.3.3.6}


\end{itemize} % ends low level
\subsection{Cas de test 2.3 : GestionCombat::gererHAUT}
\label{sec-1.4}

\subsubsection{Condition initiale :}
\label{sec-1.4.1}

\begin{itemize}

\item L =(def) init(20, 4 ,10)\\
\label{sec-1.4.1.1}


\item map = \{ <Alex, HAUT>, <RYAN, RIEN>, <SLICK, RIEN>, <???, RIEN> \}\\
\label{sec-1.4.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L0 =(def) gerer(L, map)}
\label{sec-1.4.2}

\subsubsection{Oracle :}
\label{sec-1.4.3}

\begin{itemize}

\item estFrappe(L0, ?) = false\\
\label{sec-1.4.3.1}


\item estGele(L0, ?) = false\\
\label{sec-1.4.3.2}


\item mPerso(L0).keySet() = \{ Alex, Ryan, Slick, +3 gagnster \}\\
\label{sec-1.4.3.3}


\item position(L0, Alex) = \{ 0 ; 7 ; 0 \}\\
\label{sec-1.4.3.4}


\item position(L0, Ryan) = \{ 0 ; 4 ; 0 \}\\
\label{sec-1.4.3.5}


\item position(L0, Slick) = \{ 19 ; 5 ; 0 \}\\
\label{sec-1.4.3.6}


\end{itemize} % ends low level
\subsection{Cas de test 2.4 : GestionCombat::gererBAS}
\label{sec-1.5}
