CPS-Projet/tests/html/tGestionCombat.html



<div id="outline-container-1.5.1" class="outline-4">

<h4 id="sec-1.5.1"><span class="section-number-4">1.5.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.5.1">



<ul>

<li id="sec-1.5.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.5.1.2">map = { &lt;Alex, BAS&gt;, &lt;RYAN, RIEN&gt;, &lt;SLICK, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.5.2" class="outline-4">

<h4 id="sec-1.5.2"><span class="section-number-4">1.5.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.5.2">



</div>



</div>



<div id="outline-container-1.5.3" class="outline-4">

<h4 id="sec-1.5.3"><span class="section-number-4">1.5.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.5.3">



<ul>

<li id="sec-1.5.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.5.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.5.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.5.3.4">position(L0, Alex) = { 0 ; 5 ; 0 } <br/>

</li>

<li id="sec-1.5.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.5.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.6" class="outline-3">

<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Cas de test 2.5 : GestionCombat::gererSAUTER </h3>

<div class="outline-text-3" id="text-1.6">





</div>



<div id="outline-container-1.6.1" class="outline-4">

<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.6.1">



<ul>

<li id="sec-1.6.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.6.1.2">map = { &lt;Alex, SAUTER&gt;, &lt;RYAN, RIEN&gt;, &lt;SLICK, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.6.2" class="outline-4">

<h4 id="sec-1.6.2"><span class="section-number-4">1.6.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.6.2">



</div>



</div>



<div id="outline-container-1.6.3" class="outline-4">

<h4 id="sec-1.6.3"><span class="section-number-4">1.6.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.6.3">



<ul>

<li id="sec-1.6.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.6.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.6.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.6.3.4">position(L0, Alex) = { 0 ; 6 ; 1 } <br/>

</li>

<li id="sec-1.6.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.6.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.7" class="outline-3">

<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Cas de test 2.6 : GestionCombat::gererGAUCHE </h3>

<div class="outline-text-3" id="text-1.7">





</div>



<div id="outline-container-1.7.1" class="outline-4">

<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.7.1">



<ul>

<li id="sec-1.7.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.7.1.2">map = { &lt;Alex, RIEN&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, GAUCHE&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.7.2" class="outline-4">

<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> Operation : L0 =(def) gerer(L, map) </h4>

<div class="outline-text-4" id="text-1.7.2">



</div>



</div>



<div id="outline-container-1.7.3" class="outline-4">

<h4 id="sec-1.7.3"><span class="section-number-4">1.7.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.7.3">



<ul>

<li id="sec-1.7.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.7.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.7.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.7.3.4">position(L0, Alex) = { 0 ; 6 ; 0 } <br/>

</li>

<li id="sec-1.7.3.5">position(L0, Ryan) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.7.3.6">position(L0, Slick) = { 18 ; 5 ; 0 } <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.8" class="outline-3">

<h3 id="sec-1.8"><span class="section-number-3">1.8</span> Cas de test 2.7 : GestionCombat::gererRAMASSER </h3>

<div class="outline-text-3" id="text-1.8">





</div>



<div id="outline-container-1.8.1" class="outline-4">

<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.8.1">



<ul>

<li id="sec-1.8.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.8.1.2">map1 = { &lt;Alex, BAS&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

<li id="sec-1.8.1.3">map2 = { &lt;Alex, BAS&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

<li id="sec-1.8.1.4">map3 = { &lt;Alex, RAMSSER&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.8.2" class="outline-4">

<h4 id="sec-1.8.2"><span class="section-number-4">1.8.2</span> Operation : </h4>

<div class="outline-text-4" id="text-1.8.2">



<ul>

<li id="sec-1.8.2.1">L2 =(def) gerer(L, map1) <br/>

</li>

<li id="sec-1.8.2.2">L1 =(def) gerer(L2, map2) <br/>

</li>

<li id="sec-1.8.2.3">L0 =(def) gerer(L1, map3) <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.8.3" class="outline-4">

<h4 id="sec-1.8.3"><span class="section-number-4">1.8.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.8.3">



<ul>

<li id="sec-1.8.3.1">estFrappe(L0, ?) = false <br/>

</li>

<li id="sec-1.8.3.2">estGele(L0, ?) = false <br/>

</li>

<li id="sec-1.8.3.3">mPerso(L0).keySet() = { Alex, Ryan, Slick, +3 gagnster } <br/>

</li>

<li id="sec-1.8.3.4">position(L0, Alex) = { 0 ; 4 ; 0 } <br/>

</li>

<li id="sec-1.8.3.5">position(L0, Ryan) = { 0 ; 4 ; 1 } <br/>

</li>

<li id="sec-1.8.3.6">position(L0, Slick) = { 19 ; 5 ; 0 } <br/>





</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.9" class="outline-3">

<h3 id="sec-1.9"><span class="section-number-3">1.9</span> Cas de test 2.7 : GestionCombat::gererJETER </h3>

<div class="outline-text-3" id="text-1.9">





</div>



<div id="outline-container-1.9.1" class="outline-4">

<h4 id="sec-1.9.1"><span class="section-number-4">1.9.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.9.1">



<ul>

<li id="sec-1.9.1.1">L =(def) init(20, 4 ,10) <br/>

</li>

<li id="sec-1.9.1.2">map1 = { &lt;Alex, BAS&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

<li id="sec-1.9.1.3">map2 = { &lt;Alex, BAS&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

<li id="sec-1.9.1.4">map3 = { &lt;Alex, RAMSSER&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

<li id="sec-1.9.1.5">map4 = { &lt;Alex, JETER&gt;, &lt;Ryan, RIEN&gt;, &lt;Slick, RIEN&gt;, &lt;???, RIEN&gt; } <br/>

</li>

</ul>

</div>



</div>
